# -*- coding: utf-8 -*-
"""
Пример использования модуля расчета параметров воздушных линий  PVL в соответствии с
Руководящими указаниями по релейной защите № 11 Расчеты токов короткого
замыкания для релейной защиты и системной автоматики 110-750 кВ

г.Саратов 24.11.2020г.
"""
#import numpy as np


import PVL5 as PVL

ASO300 = PVL.provod('ACО300 из примера 2.3 РУ11',0.108,23.5,0.9)
PB220 = PVL.opora('ПБ220 из примера 2.3 РУ11 h+10м', [-5.3+18j, 8.8+18j, 5.3+25.5j], [0.0, 0.0, 0.0], 0j, 0j)

sk2_3=PVL.sech('Пример 2.3 из РУ11',1.0,0.05,1000.0)
l1 = PVL.Line(sk2_3,'Линия 1',0.0,PB220.C1,ASO300,0,0,7)
l2 = PVL.Line(sk2_3,'Линия 2',30.0,PB220.C1,ASO300,0,0,7)
l3 = PVL.Line(sk2_3,'Линия 3',70.0,PB220.C1,ASO300,0,0,7)
l4 = PVL.Line(sk2_3,'Линия 4',120.0,PB220.C1,ASO300,0,0,7)
sk2_3.calc()
sk2_3.res()

PB500_2T=PVL.opora('ПБ500-2т из примера 2.4 РУ11',(-12+27j,0+27j,12+27j),(0.0,0.0,0.0),-8.1+32j,8.1+32j)
ASO400=PVL.provod('ACО400 из примера 2.4 РУ11',0.078,27.2,0.9)
ASO400_3_04=ASO400.RaschPr('3*ACО400-0.4м',3,0.4)
S70=PVL.provod('С-70',2.625,13.0)

sk2_4=PVL.sech('Примеры 2.4 и 2.6 из РУ11',1.0,0.05,1000.0)
l1 = PVL.Line(sk2_4,'Линия 1',0.0,PB500_2T.C1,ASO400_3_04,5.0,0,14)
t1_1 = PVL.Line(sk2_4,'Трос 1 Линия 1',0.0,PB500_2T.T1,S70,0.5,1,14)
t1_2 = PVL.Line(sk2_4,'Трос 2 Линия 2',0.0,PB500_2T.T2,S70,0.5,1,14)
l2 = PVL.Line(sk2_4,'Линия 2',50.0,PB500_2T.C1,ASO400_3_04,5.0,0,14)
t2_1 = PVL.Line(sk2_4,'Трос 1 Линия 2',50.0,PB500_2T.T1,S70,0.5,1,14)
t2_2 = PVL.Line(sk2_4,'Трос 2 Линия 2',50.0,PB500_2T.T2,S70,0.5,1,14)
sk2_4.calc()
sk2_4.res()

AC_150_24 = PVL.provod('AC-150/24', 0.198+0.000j, 17.1, 0.95)
S50=PVL.provod('С-50',3.75,9.1)
PS70D=PVL.izol('ПС-70Д',0.127)
PB110_1 = PVL.opora('ПБ110-1', [-2.0+14.5j, 3.5+14.5j, 2.0+17.5j], [0.0, 0.0, 0.0], 0.0+19.5j, 0.0+0.0j)

sk3=PVL.sech('Пример с 4-мя ВЛ 110 кВ',1.0,0.05,1000.0)
pl1 = PVL.Line(sk3,'Линия 1',0.0,PB110_1.C1,AC_150_24,PS70D(8),0,5.5)
t1_1 = PVL.Line(sk3,'Трос 1 Линия 1',0.0,PB110_1.T1,S50,0.0,2,5.5)
pl2 = PVL.Line(sk3,'Линия 2',30.0,PB110_1.C1,AC_150_24,PS70D(8),0,5.5)
t2_1 = PVL.Line(sk3,'Трос 1 Линия 2',30.0,PB110_1.T1,S50,0.0,2,5.5)
pl3 = PVL.Line(sk3,'Линия 3',60.0,PB110_1.C1,AC_150_24,PS70D(8),0,5.5)
t3_1 = PVL.Line(sk3,'Трос 1 Линия 3',60.0,PB110_1.T1,S50,0.0,2,5.5)
pl4 = PVL.Line(sk3,'Линия 4',90.0,PB110_1.C1,AC_150_24,PS70D(8),0,5.5)
t4_1 = PVL.Line(sk3,'Трос 1 Линия 4',90.0,PB110_1.T1,S50,0.0,2,5.5)

sk3.calc()
sk3.res()
